# Дан список:
# ['в', '5', 'часов', '17', 'минут', 'температура', 'воздуха', 'была', '+5', 'градусов']
# Необходимо его обработать — обособить каждое целое число (вещественные не трогаем) кавычками (добавить кавычку до и кавычку после элемента списка, являющегося числом) и дополнить нулём до двух целочисленных разрядов:
# ['в', '"', '05', '"', 'часов', '"', '17', '"', 'минут', 'температура', 'воздуха', 'была', '"', '+05', '"', 'градусов']
# Сформировать из обработанного списка строку:
# в "05" часов "17" минут температура воздуха была "+05" градусов
# Подумать, какое условие записать, чтобы выявить числа среди элементов списка? Как модифицировать это условие для чисел со знаком?
# Примечание: если обособление чисел кавычками не будет получаться - можете вернуться к его реализации позже. Главное: дополнить числа до двух разрядов нулём!

main_list = ['в', '5', 'часов', '17', 'минут', 'температура', 'воздуха', 'была', '+5', 'градусов']
new_list = []
# zero = '0'
for tmp in main_list:
    if tmp.isdigit():
        new_list.extend(['"', f'{int(tmp):02d}', '"'])
    elif (tmp[0] == '+' or tmp[0] == '-') and tmp[1:].isdigit():
        plus_or_minus = tmp[0]
        new_list.extend(['"', plus_or_minus + f'{int(tmp[1:]):02d}', '"'])
    else:
        new_list.append(tmp)

result = ' '.join(new_list)
print(result)
# print(main_list)